In [2]:
import pandas as pd
df= pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')

In [6]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female   male
0   False   True
1    True  False
2    True  False
3    True  False
4   False   True

In [7]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female   male
0       3    male  22.0   7.2500   False   True
1       1  female  38.0  71.2833    True  False
2       3  female  26.0   7.9250    True  False
3       1  female  35.0  53.1000    True  False
4       3    male  35.0   8.0500   False   True

In [8]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female   male
0       3  22.0   7.2500   False   True
1       1  38.0  71.2833    True  False
2       3  26.0   7.9250    True  False
3       1  35.0  53.1000    True  False
4       3  35.0   8.0500   False   True

In [9]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [14]:
inputs.Age[:20]

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      NaN
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
15    55.0
16     2.0
17     NaN
18    31.0
19     NaN
Name: Age, dtype: float64

In [16]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(20)

    Pclass        Age     Fare  female   male
0        3  22.000000   7.2500   False   True
1        1  38.000000  71.2833    True  False
2        3  26.000000   7.9250    True  False
3        1  35.000000  53.1000    True  False
4        3  35.000000   8.0500   False   True
5        3  29.699118   8.4583   False   True
6        1  54.000000  51.8625   False   True
7        3   2.000000  21.0750   False   True
8        3  27.000000  11.1333    True  False
9        2  14.000000  30.0708    True  False
10       3   4.000000  16.7000    True  False
11       1  58.000000  26.5500    True  False
12       3  20.000000   8.0500   False   True
13       3  39.000000  31.2750   False   True
14       3  14.000000   7.8542    True  False
15       2  55.000000  16.0000    True  False
16       3   2.000000  29.1250   False   True
17       2  29.699118  13.0000   False   True
18       3  31.000000  18.0000    True  False
19       3  29.699118   7.2250    True  False

In [45]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [46]:
len(x_train)

712

In [47]:
len(x_test)

179

In [48]:
len(inputs)

891

In [49]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [50]:
model.fit(x_train,y_train)

GaussianNB()

In [51]:
model.score(x_test,y_test)

0.7932960893854749

In [52]:
y_test[:10]

435    1
237    1
877    0
454    0
622    1
216    1
341    1
339    0
269    1
834    0
Name: Survived, dtype: int64

In [53]:
model.predict(x_test[:10])

array([1, 1, 0, 0, 0, 1, 1, 0, 1, 0], dtype=int64)